{
  "balades": [
    {
      "id": 1,
      "name": "Moudon par la petite porte",
      "catchPhrase": "La ville haute de la «capitale» du pays de Vaud savoyard constitue un ensemble architectural exceptionnel du Moyen-Âge et de l'Ancien Régime. Invitation à le parcourir sous tous ses angles.",
      "duration": 75,
      "location": 1510,
      "previewPath": "/1/preview.png",
      "map": "/1/map.png",
      "infos": [
        {
          "icon": "line_start_circle",
          "name": "Départ",
          "description": "Gare de Moudon"
        },
        {
          "icon": "line_end_circle",
          "name": "Arrivée",
          "description": "Gare de Bressonaz"
        },
        {
          "icon": "pin_drop",
          "name": "Distance",
          "description": "~5km"
        },
        {
          "icon": "altitude",
          "name": "Dénivelé",
          "description": "+180m -180m"
        }
      ],
      "favoriteIds": [
        1,
        2
      ],
      "ratings": [
        1,
        2,
        3
      ],
      "content": {
        "details": "Pour se rendre à Moudon, en venant des rives du Léman, on doit tout  d'abord traverser le haut plateau vallonné du Jorat. À la hauteur du  village de Vucherens s'ouvre la large vallée de la Broye moyenne. Une  longue descente conduit au hameau de Bressonnaz, point de départ de  notre balade.",
        "sections": [
          {
            "id": 1,
            "title": "Moudon par la petite porte",
            "content": [
              {
                "type": "text",
                "text": "Le hameau de Bressonnaz se situe au confluent de trois rivières: la Broye sortant du défilé de Brivaux, le Carrouge et la Bressonne. C’était aussi un important nœud routier ayant nécessité la construction de plusieurs ponts. Le plus ancien, franchissant la Bressonne, a été recouvert par la grande route actuelle dont le fort impact perturbe la compréhension du site historique. Les deux autres ont été entrepris entre 1698 et 1701 afin de favoriser l’axe de transit par la vallée de la Broye. Jusqu’alors, les gros «chars d’Allemagne» venant du Jorat devaient soit passer la Broye à gué pour rejoindre la rive droite, soit longer la rive gauche, puis traverser avec beaucoup de peine la ville haute de Moudon (notre itinéraire).\nLe grand pont sur la Broye a été transformé au niveau des parapets, tandis que le petit pont sur le Carrouge est entièrement conservé. Tous les deux portent encore leur inscription gravée par l’entrepreneur Jean Favre, de Neuchâtel. On peut s’amuser à y déchiffrer la date de construction: en additionnant les lettres plus grandes correspondant à des chiffres romains, on obtient le millésime de 1698 pour le grand pont et 1701 pour le petit.\n\nLe hameau était autrefois beaucoup plus animé, avec son péage, ses trois moulins et son auberge, dont on peut voir encore le très grand rural de 1824. Il ne subsiste qu’un restaurant et la petite gare de Bressonnaz,  désaffectée."
              },
              {
                "type": "image/normal",
                "path": "/1/2.jpg",
                "legend": "Caché par la verdure, le petit pont en dos d’âne qui franchit le  confluent du Carrouge et de la Bressonne a conservé à son sommet la  stèle et l’inscription en capitales romaines rappelant qu’il a été  construit par ordre du trésorier de la puissante République de Berne et  sous la protection de Dieu."
              },
              {
                "type": "image/side",
                "path": "/1/1.png",
                "legend": "Carte: Hélène Becquelin."
              }
            ]
          },
          {
            "id": 2,
            "title": "En route pour Moudon",
            "content": [
              {
                "type": "text",
                "text": "Prendre le pont qui traverse la grande route de Berne, puis tourner 2 droite sur le chemin de Valacrér. Notre itinéraire suit la route d'ori- gine romaine, sur le coteau dominant la rive gauche de la Broye. Longer la caserne sanitaire, qui s'éléve 2 lemplacement d'un érablissement romain. Plus loin, 2 gauche, la ferme de Valacrét, typique du début du XIX¢ siécle avec son logement et son rural séparés."
              },
              {
                "type": "text",
                "text": "Des panneaux archéologiques donnent toutes les indications  nécessaires sur l’état originel des lieux ainsi que sur les aménagements urbains effectués dans les années 1990, lors d’importants travaux de  consolidation de la colline.\n\nLa rue du Château, qui descend au-dessous de l’ancienne église,  pourrait s’appeler la rue des arcades. Elle était en effet longée des  deux côtés par des portiques d’arcades surélevés reposant sur des  avant-caves. Ces dernières témoignent de l’activité marchande de ce  quartier. Certaines de ces arcades, murées au XVIe siècle, ont été  dégagées. La plus connue, rue du Château 42, a pu être datée de 1280. Au milieu de la rangée nord, la maison dite bernoise fait exception, du  fait que la terrasse est protégée non pas par des arcades de pierre mais par un profond avant-toit sur poteau. Au-devant de la grande tour du château, l’ancien fossé a été aménagé  en une place de pique-nique. N’hésitez pas à ouvrir la poterne qui vous  permettra d’avoir une vue sur la Mérine et sur les arrières de la tour,  dont l’enceinte s’est effondrée plusieurs fois depuis le XVe siècle.\nRevenir sur la place de la Poterne pour admirer la célèbre «maison des États» et sa façade du XVe siècle. A la hauteur du n° 11, à  l’endroit le plus raide de la rue, une porte barrait l’accès oriental du noyau primitif du castrum. Au-dessous, le quartier de  Rotto-Borgeau (bourg abrupt) était autrefois bâti des deux côtés mais,  la Broye ayant rongé la falaise, les maisons ont été remplacées ici par  un haut mur daté de 1665.\nArrivés sur terrain plat aux Plans-Borgeaux, vous trouverez au  pied de la fontaine de la Justice l’Office du tourisme, qui tient à  disposition la documentation utile pour une visite de la ville basse. Ce quartier est riche lui aussi en surprises et en monuments, parmi  lesquels la très belle église gothique de Saint-Étienne."
              },
              {
                "type": "image/normal",
                "path": "/1/3.png",
                "legend": "Le long de la Broye sur le chemin du retour."
              },
              {
                "type": "image/side",
                "path": "/1/4.png",
                "legend": "Le poteau qui soutient depuis 1646 le grand avant-toit de la «maison  bernoise» est en fait plutôt caractéristique des «dômes» genevois. Cette toiture imposante abrite en réalité trois maisons d’origine médiévale,  bien visibles au niveau des caves et à l’arrière."
              }
            ]
          },
          {
            "id": 3,
            "title": "La ville haute",
            "content": [
              {
                "type": "text",
                "text": "Pour se rendre à Moudon, en venant des rives du Léman, on doit tout d’abord traverser le haut plateau vallonné du Jorat. À la hauteur du village de Vucherens s’ouvre la large vallée de la Broye moyenne. Une longue descente conduit au hameau de Bressonnaz, point de départ de notre balade."
              },
              {
                "type": "image/normal",
                "path": "/1/5.png",
                "legend": "Vue sur le quartier du Vieux-Bourg et le château de Carrouge depuis le  chemin de Valacrêt. Les maisons du Vieux-Bourg dominant la falaise  possèdent souvent deux niveaux de caves en partie taillés dans la  molasse"
              },
              {
                "type": "image/side",
                "path": "/1/6.png",
                "legend": ""
              }
            ]
          }
        ]
      },
      "attributions": {
        "Illustrations": "Hélène Becquelin",
        "Textes": "Monique Fontannaz",
        "Images": "Jean-Claude Péclet"
      },
      "seeMore": [
        "Monique Fontannaz: “La ville de Moudon et ses musées”, Berne 2002",
        "Monique Fontannaz: Les monuments art et d'histoire du canton de Vaud, VI, La ville de Illoudon (Société d'histoire de l'art en Suisse), Berne, 2006",
        "Wikipedia: Le vallon des Vaux"
      ],
      "tagIds": [
        1,
        2
      ]
    },
    {
      "id": 2,
      "name": "Les mystères de Lavaux",
      "catchPhrase": "Explorez les vignobles en terrasses de Lavaux, classés au patrimoine mondial de l'UNESCO, et découvrez des panoramas à couper le souffle sur le lac Léman.",
      "duration": 120,
      "location": 1096,
      "previewPath": "/2/preview.png",
      "map": "/2/map.png",
      "infos": [
        {
          "icon": "f816",
          "name": "Départ",
          "description": "Gare de Cully"
        },
        {
          "icon": "f81b",
          "name": "Arrivée",
          "description": "Gare de Lutry"
        },
        {
          "icon": "f6ea",
          "name": "Distance",
          "description": "~20km"
        },
        {
          "icon": "f873",
          "name": "Dénivelé",
          "description": "+210m -185m"
        }
      ],
      "favoriteIds": [
        3,
        4
      ],
      "ratings": [
        4,
        5
      ],
      "content": {
        "details": "Cette balade vous emmène à travers les vignobles en terrasses de Lavaux, un paysage unique façonné par des siècles de travail humain. Classé au patrimoine mondial de l'UNESCO, Lavaux est un véritable joyau de la Suisse romande. En chemin, vous découvrirez des villages pittoresques, des caves à vin accueillantes et des panoramas à couper le souffle sur le lac Léman et les Alpes. Que vous soyez amateur de randonnée, passionné de vin ou simplement à la recherche d'une escapade paisible, cette balade a tout pour plaire.",
        "sections": [
          {
            "id": 1,
            "title": "Départ de Cully",
            "content": [
              {
                "type": "text",
                "text": "La balade commence à la gare de Cully, un village charmant et paisible entouré de vignobles. Dès votre arrivée, vous serez accueilli par l'atmosphère chaleureuse de ce lieu historique. Traversez le village en suivant les panneaux indiquant les sentiers de Lavaux. Très vite, vous serez plongé dans un paysage de terrasses verdoyantes, où chaque vigne semble raconter une histoire. Prenez le temps de vous arrêter pour admirer les premières vues sur le lac Léman, dont les eaux scintillantes contrastent magnifiquement avec le vert des vignobles."
              },
              {
                "type": "image/normal",
                "path": "/2/1.jpg",
                "legend": "Les vignobles de Lavaux au lever du soleil, un spectacle inoubliable."
              },
              {
                "type": "image/side",
                "path": "/2/2.png",
                "legend": "Carte des sentiers de Lavaux, pour vous guider tout au long de votre balade."
              }
            ]
          },
          {
            "id": 2,
            "title": "À travers les vignobles",
            "content": [
              {
                "type": "text",
                "text": "En suivant le sentier principal, vous traverserez les vignobles en terrasses qui font la renommée de Lavaux. Ces terrasses, construites à flanc de colline, offrent une vue imprenable sur le lac Léman et les montagnes environnantes. En chemin, vous passerez par des villages pittoresques comme Epesses et Grandvaux. Ces villages, avec leurs ruelles étroites et leurs maisons en pierre, semblent figés dans le temps. Profitez-en pour visiter une cave à vin locale et déguster les crus de Lavaux, réputés pour leur qualité exceptionnelle. Les vignerons se feront un plaisir de partager avec vous leur passion et leur savoir-faire."
              },
              {
                "type": "image/normal",
                "path": "/2/3.png",
                "legend": "Vue sur le lac Léman depuis les vignobles, un panorama à couper le souffle."
              },
              {
                "type": "image/side",
                "path": "/2/4.png",
                "legend": "Les terrasses de Lavaux, un chef-d'œuvre de l'ingénierie humaine et de la nature."
              }
            ]
          },
          {
            "id": 3,
            "title": "Arrivée à Lutry",
            "content": [
              {
                "type": "text",
                "text": "La balade se termine à Lutry, un village historique situé au bord du lac Léman. Prenez le temps d'explorer ses ruelles pavées, ses églises anciennes et ses terrasses accueillantes. Lutry est également un excellent point de départ pour d'autres aventures, que ce soit une croisière sur le lac ou une visite des vignobles environnants. Avant de partir, n'oubliez pas de vous arrêter dans l'un des nombreux cafés ou restaurants pour savourer une spécialité locale tout en profitant de la vue sur le lac."
              },
              {
                "type": "image/normal",
                "path": "/2/5.png",
                "legend": "Le village de Lutry, une destination parfaite pour conclure votre balade."
              },
              {
                "type": "image/side",
                "path": "/2/6.png",
                "legend": "Carte des points d'intérêt à Lutry, pour prolonger votre visite."
              }
            ]
          }
        ]
      },
      "attributions": {
        "Illustrations": "Jean Dupont",
        "Textes": "Marie Curie",
        "Images": "Paul Durand"
      },
      "seeMore": [
        "Office du tourisme de Lavaux: www.lavaux.ch",
        "Wikipedia: Lavaux, vignobles en terrasses",
        "Guide des vins de Lavaux"
      ],
      "tagIds": [
        1,
        2
      ]
    },
    {
      "id": 3,
      "name": "Au fil de l'eau : Visite du barrage d'Émosson",
      "catchPhrase": "Découvrez le majestueux barrage d'Émosson, un chef-d'œuvre d'ingénierie niché au cœur des Alpes, et laissez-vous émerveiller par des paysages à couper le souffle.",
      "duration": 180,
      "location": 1925,
      "previewPath": "/3/preview.jpg",
      "map": "/3/map.png",
      "infos": [
        {
          "icon": "f816",
          "name": "Départ",
          "description": "En bas barrage"
        },
        {
          "icon": "f81b",
          "name": "Arrivée",
          "description": "En haut du barrage"
        },
        {
          "icon": "f6ea",
          "name": "Distance",
          "description": "~15km"
        },
        {
          "icon": "f873",
          "name": "Dénivelé",
          "description": "+550m -40m"
        }
      ],
      "favoriteIds": [
        5,
        6
      ],
      "ratings": [
        5,
        4,
        5
      ],
      "content": {
        "details": "Cette balade vous emmène à la découverte du barrage d'Émosson, un site emblématique des Alpes suisses. Situé à 1930 mètres d'altitude, ce barrage impressionnant est entouré de paysages alpins spectaculaires. En chemin, vous traverserez des sentiers bordés de fleurs sauvages, des forêts alpines et des points de vue à couper le souffle. Que vous soyez passionné d'ingénierie, amoureux de la nature ou simplement à la recherche d'une escapade paisible, cette balade est une expérience inoubliable.",
        "sections": [
          {
            "id": 1,
            "title": "Départ au pied du barrage",
            "content": [
              {
                "type": "text",
                "text": "La balade commence au parking du barrage d'Émosson. Dès le départ, vous serez impressionné par la grandeur de cet ouvrage d'ingénierie, construit pour retenir les eaux de fonte des glaciers environnants. Suivez le sentier qui monte doucement vers le sommet du barrage. En chemin, vous traverserez une forêt alpine où le chant des oiseaux et le murmure des ruisseaux créent une ambiance apaisante. Prenez le temps de vous arrêter aux différents points de vue pour admirer les montagnes environnantes et le lac d'Émosson qui se dévoile peu à peu."
              },
              {
                "type": "image/normal",
                "path": "/3/1.jpg",
                "legend": "Vue depuis le pied du barrage d'Émosson, un chef-d'œuvre d'ingénierie."
              },
              {
                "type": "image/side",
                "path": "/3/2.jpg",
                "legend": "Carte des sentiers autour du barrage d'Émosson."
              }
            ]
          },
          {
            "id": 2,
            "title": "Le sommet du barrage",
            "content": [
              {
                "type": "text",
                "text": "Une fois arrivé au sommet du barrage, vous serez récompensé par une vue panoramique à 360 degrés sur les Alpes suisses et françaises. Le lac d'Émosson, avec ses eaux turquoise, contraste magnifiquement avec les sommets enneigés qui l'entourent. Prenez le temps de marcher le long du barrage pour explorer ses différentes facettes. Vous pourrez également en apprendre davantage sur son histoire et son rôle dans la production d'énergie hydroélectrique grâce aux panneaux d'information disposés tout au long du parcours."
              },
              {
                "type": "image/normal",
                "path": "/3/3.jpg",
                "legend": "Le lac d'Émosson, entouré de montagnes majestueuses."
              },
              {
                "type": "image/side",
                "path": "/3/4.jpg",
                "legend": "Vue aérienne du barrage d'Émosson et de son lac."
              }
            ]
          },
          {
            "id": 3,
            "title": "Retour par le sentier des dinosaures",
            "content": [
              {
                "type": "text",
                "text": "Pour le retour, empruntez le célèbre sentier des dinosaures, qui vous mènera à un site unique où des empreintes de dinosaures datant de plus de 200 millions d'années ont été découvertes. Ce sentier, bien balisé, offre une expérience à la fois éducative et ludique. En chemin, vous pourrez également profiter de nouveaux points de vue sur le barrage et les montagnes environnantes. La descente se fait en douceur, vous ramenant au point de départ avec des souvenirs inoubliables."
              },
              {
                "type": "image/normal",
                "path": "/3/5.jpg",
                "legend": "Empreintes de dinosaures sur le sentier, une fenêtre sur le passé."
              },
              {
                "type": "image/side",
                "path": "/3/6.jpg",
                "legend": "Carte du sentier des dinosaures, un incontournable pour les curieux."
              }
            ]
          }
        ]
      },
      "attributions": {
        "Illustrations": "Jean Dupont",
        "Textes": "Marie Curie",
        "Images": "Paul Durand"
      },
      "seeMore": [
        "Office du tourisme d'Émosson: www.emosson.ch",
        "Wikipedia: Barrage d'Émosson",
        "Guide des Alpes suisses"
      ],
      "tagIds": [
        2,
        1
      ]
    }
  ],
  "tags": [
    {
      "id": 1,
      "name": "Forêt",
      "icon": "forest",
      "category": "terrain"
    },
    {
      "id": 2,
      "name": "Montagne",
      "icon": "landscape",
      "category": "terrain"
    },
    {
      "id": 3,
      "name": "Lac",
      "icon": "water",
      "category": "terrain"
    },
    {
      "id": 4,
      "name": "Peu de dénivelé",
      "icon": "arrow_right_alt",
      "category": "terrain"
    },
    {
      "id": 5,
      "name": "Routes",
      "icon": "local_taxi",
      "category": "terrain"
    },
    {
      "id": 10,
      "name": "Paléolithique",
      "icon": "camping",
      "category": "period"
    },
    {
      "id": 11,
      "name": "Néolithique",
      "icon": "local_fire_department",
      "category": "period"
    },
    {
      "id": 12,
      "name": "Antiquité",
      "icon": "add",
      "category": "period"
    },
    {
      "id": 13,
      "name": "Moyen Age",
      "icon": "castle",
      "category": "period"
    },
    {
      "id": 14,
      "name": "Temps modernes",
      "icon": "settings_input_antenna",
      "category": "period"
    },
    {
      "id": 15,
      "name": "Époque contemporaine",
      "icon": "local_taxi",
      "category": "period"
    },
    {
      "id": 20,
      "name": "Parcours sportif",
      "icon": "directions_run",
      "category": "criteria"
    },
    {
      "id": 21,
      "name": "Parcours interactif",
      "icon": "touch_app",
      "category": "criteria"
    },
    {
      "id": 22,
      "name": "Accessible",
      "icon": "accessible",
      "category": "criteria"
    },
    {
      "id": 23,
      "name": "Restauration possible",
      "icon": "restaurant",
      "category": "criteria"
    },
    {
      "id": 24,
      "name": "Traductions",
      "icon": "language",
      "category": "criteria"
    },
    {
      "id": 25,
      "name": "Familles",
      "icon": "family_restroom",
      "category": "criteria"
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "admin",
      "password": "admin",
      "profilePicture": "assets/avatars/1.jpeg"
    },
    {
      "id": 2,
      "username": "john",
      "password": "doe",
      "profilePicture": "assets/avatars/2.png"
    }
  ]
}